typedef HomeSection = ({
  String label,
  String bgImage,
  List<SectionDetail> details
});

typedef SectionDetail = ({String label, String description, String url});

List<HomeSection> get homeSections => [
      (
        label: 'Ресурси',
        bgImage: 'assets/images/prints/snake.png',
        details: [
          (
            label: "Ветеран PRO",
            description:
                "Цифрова платформа, яка об'єднує сервіси, послуги, медичну та фінансову підтримку залежно від вашого регіону.",
            url: "https://veteranpro.gov.ua"
          ),
          (
            label: "Міністерство у справах ветеранів України",
            description:
                "Офіційний сайт відомства, де публікуються актуальні новини, програми відновлення та керівні документи.",
            url: "https://mva.gov.ua"
          ),
          (
            label: "Е-Ветеран",
            description:
                "Інформаційна система, на якій доступні довідники щодо пільг, а також інформація щодо послуг з психологічної допомоги.",
            url: "https://eveteran.gov.ua"
          ),
          (
            label: "Український ветеранський фонд",
            description:
                "Організація надає інформацію про кар'єрні можливості (наприклад, платформа Кар'єра ветерана) та гранти на розвиток власного бізнесу для ветеранів.",
            url: "https://veteranfund.com.ua"
          ),
          (
            label: "Портал Дія",
            description:
                "Місце, де можна подати заявку на отримання ветеранського бізнес-гранту або скористатися іншими електронними послугами.",
            url:
                "https://diia.gov.ua/services/grant-dlya-veteraniv-ta-chleniv-yihnih-simej"
          )
        ]
      ),
      (
        label: 'Державні програми підтримки ветеранів',
        bgImage: 'assets/images/prints/zebra.png',
        details: [
          (
            label: 'Бізнес та гранти',
            description:
                'Урядова програма «єРобота» надає гранти на започаткування або розвиток власного бізнесу ветеранами та їхніми родинами у розмірі від 250 тис. до 1 млн грн. Подати заявку можна через портал Дія.',
            url:
                "https://diia.gov.ua/services/grant-dlya-veteraniv-ta-chleniv-yihnih-simej"
          ),
          (
            label: 'Житлові програми',
            description:
                'Ветерани мають змогу отримати пільгові іпотечні кредити (програма єОселя), грошову компенсацію на придбання житла або компенсацію витрат на оренду, попередньо ставши на квартирний облік.',
            url:
                "https://veteranpro.gov.ua/thematic-block/zhytlo_ta_infrastruktura"
          ),
          (
            label: 'Медична та психологічна допомога',
            description:
                'Надання безоплатних ліків, стоматологічних послуг, безкоштовного протезування, а також реабілітація та психологічна підтримка.',
            url:
                "https://veteranpro.gov.ua/thematic-block/zdorovya_ta_vidnovlennya"
          ),
          (
            label: 'Фінансові виплати',
            description:
                'Щорічна разова грошова допомога до Дня Незалежності України (оформлюється через особистий кабінет на порталі Пенсійного фонду України).',
            url:
                "https://guide.diia.gov.ua/view/vyplata-shchorichnoi-razovoi-hroshovoi-dopomohy-veteranam-viiny-i-zhertvam-natsystskykh-peresliduvan-b6f9853d-5505-4d7c-93d6-dedb5830d737"
          ),
          (
            label: 'Освіта',
            description:
                'Програми професійного навчання, ваучери на перекваліфікацію та підтримка здобуття вищої освіти.',
            url: "https://veteranpro.gov.ua/thematic-block/osvita_ta_robota"
          ),
        ]
      ),
      (
        label: 'Бізнеси засновані ветеранами',
        bgImage: 'assets/images/prints/tiger.png',
        details: [
          (
            label: "Veterano Group",
            description:
                "Мережа піцерій та кав’ярень, заснована ветераном Леонідом Остальцевим, яка відома працевлаштуванням інших ветеранів.",
            url: "https://veteranopizza.com"
          ),
          (
            label: "Екоферма «Козацьке подвір’я»",
            description:
                "Фермерське господарство ветерана Сергія Свириденка, яке було релоковане з Донеччини на Волинь і спеціалізується на крафтових сирах та м'ясних виробах.",
            url: "https://kozak-craft.com.ua"
          ),
          (
            label: "AeroDrone",
            description:
                "Компанія, заснована ветеранами Юрієм Педерієм та Дмитром Шимковим (розробка та виробництво безпілотних літальних апаратів).",
            url: "https://aerodrone.ua"
          ),
          (
            label: "Ruff the Ruff",
            description:
                "Багато ветеранів відкривають власне виробництво тактичного спорядження, одягу або взуття, використовуючи свій безцінний бойовий досвід. Наприклад, ветеранські швейні майстерні шиють як мілітарі-продукцію, так і стильний цивільний одяг.",
            url: ""
          )
        ]
      ),
      (
        label: 'Волонтерство',
        bgImage: 'assets/images/prints/cheeta.png',
        details: [
          (
            label: "Повернись живим",
            description:
                "Один із найбільших фондів компетентної допомоги армії. Закуповує тепловізори, квадрокоптери, бронетехніку, а також навчає інструкторів та військових спеціалістів.",
            url: ""
          ),
          (
            label: "Фонд Сергія Притули",
            description:
                "Потужний благодійний фонд, що забезпечує підрозділи фронту засобами зв'язку, транспортом, бронетехнікою та ударними дронами, а також веде великий гуманітарний напрям.",
            url: ""
          ),
          (
            label: "Український ветеранський фонд",
            description:
                "Державна установа, що працює виключно для ветеранів. Надає гранти на відкриття чи розвиток ветеранського бізнесу, юридичну та психологічну підтримку",
            url: ""
          ),
          (
            label: "Госпітальєри (Медичний батальйон)",
            description:
                "Добровольча організація парамедиків, яка займається евакуацією поранених захисників із найгарячіших точок фронту.",
            url: ""
          ),
          (
            label: "United24",
            description:
                "Офіційна фандрейзингова платформа, започаткована Президентом України. Зібрані кошти спрямовуються за різними напрямами: від закупівлі дронів до медичного забезпечення.",
            url: ""
          ),
          (
            label: "Благодійний фонд Діани Макарової",
            description:
                "Відома волонтерська ініціатива, що спеціалізується на забезпеченні передової тактичним спорядженням, авто та гуманітарними вантажами.",
            url: ""
          ),
          (
            label: "Армія SOS",
            description:
                "Фонд, який виготовляє та постачає на фронт безпілотники, системи управління вогнем та забезпечує бійців сучасними засобами зв'язку та розвідки.",
            url: ""
          ),
          (
            label: "Фонд «Повернення додому» / Project Victory",
            description:
                "Ініціативи та громадські спілки, що сприяють працевлаштуванню, фізкультурно-спортивній реабілітації та адаптації ветеранів",
            url: ""
          ),
          (
            label: "ГО «Вільний вибір»",
            description:
                "Організація, яка надає фахову психологічну та психотерапевтичну допомогу ветеранам російсько-української війни та їхнім родинам.",
            url: ""
          ),
          (
            label: "Благодійний фонд «Україна в наших серцях»",
            description:
                "Займається забезпеченням військових формувань і надає адресну допомогу ветеранам та їхнім сім'ям.",
            url: ""
          )
        ]
      ),
      (
        label: "Цивільне суспільство [кар'єра]",
        bgImage: 'assets/images/prints/leopard.png',
        details: [
          (
            label: "Кар'єра ветерана",
            description:
                "Державна платформа від Українського ветеранського фонду. Дозволяє шукати роботу, проходити онлайн-навчання та подаватися на гранти для розвитку власного бізнесу.",
            url: "https://work.veteranfund.com.ua"
          ),
          (
            label: "ВЕТЕРАН+",
            description:
                "Спеціалізований портал, де зібрані вакансії для військовослужбовців ЗСУ та демобілізованих осіб від перевірених роботодавців. ",
            url: "https://veteran.plus"
          ),
          (
            label: "Veteran Hub",
            description:
                "Організація надає комплексну підтримку, проводить консультації та розміщує актуальні пропозиції, орієнтовані на ветеранів.",
            url: "https://veteranhub.com.ua/pro-hub/vacancies/"
          ),
          (
            label: "Work.ua",
            description:
                "Має окремий розділ «Перевага ветеранам», де роботодавці, які цінують військовий досвід та створюють інклюзивні умови, відмічають свої вакансії. ",
            url: "https://www.work.ua/jobs/veterans/"
          ),
          (
            label: "Robota.ua",
            description:
                "Великий портал, що має зручний фільтр для пошуку роботи за запитом «Ветеран» у різних областях України.",
            url: "https://robota.ua/zapros/veteran/ukraine"
          )
        ]
      ),
      (
        label: 'Саморозвиток [особистісне зростання]',
        bgImage: 'assets/images/prints/leaves.png',
        details: [
          (
            label: "Єдина ветеранська політика",
            description:
                "На платформі Ветеран PRO зібрано цифрові послуги, інформацію про освіту, гранти, перекваліфікацію та працевлаштування.",
            url:
                "https://veteranpro.gov.ua/thematic-block/osvita_ta_robota#perekvalifikaciya-ta-navchannya"
          ),
          (
            label: "Державні освітні можливості",
            description:
                "Портал Освіта для Ветеранів містить понад 1200 навчальних програм та курсів для здобуття нової цивільної професії.",
            url: "https://osvitaveteraniv.gov.ua"
          ),
          (
            label: "Навчання та кар'єра",
            description:
                "Програма Ветеранське коло від Prometheus допомагає адаптувати військовий досвід, опанувати нову спеціальність (наприклад, OSINT, маркетинг) та надає річний кар'єрний супровід.",
            url: "https://prometheus.org.ua/prometheus-plus/veteran-circle/"
          )
        ]
      ),
    ];
